In [5]:
from numpy import *
from pandas import *
import numpy as np
import pandas as pd

In [6]:
score = pd.DataFrame({
    "Chinese": [95,96,99,90,85,99],
    "English": [95,92,99,92,93,94],
    "Biology": [91,88,100,81,93,91],
    "Com-Sci": [99,90,87,86,99,83],
})

In [4]:
score

   Chinese  English  Biology  Com-Sci
0       95       95       91       99
1       96       92       88       90
2       99       99      100       87
3       90       92       81       86
4       85       93       93       99
5       99       94       91       83

In [16]:
score.index = ["Janice","Vivian","May","Lisa","Eason","Amelia"]

In [52]:
score

        Chinese  English  Biology  Com-Sci  History
Janice       95       95       91       99      NaN
Vivian       96       92       88       90      NaN
May          99       99      100       87     90.0
Lisa         90       92       81       86     93.0
Eason        85       93       93       99     85.0
Amelia       99       94       91       83      NaN

In [15]:
score.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Chinese  6 non-null      int64
 1   English  6 non-null      int64
 2   Biology  6 non-null      int64
 3   Com-Sci  6 non-null      int64
dtypes: int64(4)
memory usage: 320.0 bytes

In [7]:
score.size

24

In [51]:
score.describe() #後面可以加.round()

        Chinese    English     Biology    Com-Sci    History
count   6.00000   6.000000    6.000000   6.000000   3.000000
mean   94.00000  94.166667   90.666667  90.666667  89.333333
std     5.51362   2.639444    6.218253   6.831301   4.041452
min    85.00000  92.000000   81.000000  83.000000  85.000000
25%    91.25000  92.250000   88.750000  86.250000  87.500000
50%    95.50000  93.500000   91.000000  88.500000  90.000000
75%    98.25000  94.750000   92.500000  96.750000  91.500000
max    99.00000  99.000000  100.000000  99.000000  93.000000

In [17]:
score

        Chinese  English  Biology  Com-Sci
Janice       95       95       91       99
Vivian       96       92       88       90
May          99       99      100       87
Lisa         90       92       81       86
Eason        85       93       93       99
Amelia       99       94       91       83

In [20]:
score.loc["Vivian"] #select data by index

Chinese    96
English    92
Biology    88
Com-Sci    90
Name: Vivian, dtype: int64

In [18]:
score.iloc[-1] #select when u dunno index name

Chinese    99
English    94
Biology    91
Com-Sci    83
Name: Amelia, dtype: int64

In [20]:
score["Chinese"]#give entire column

Janice    95
Vivian    96
May       99
Lisa      90
Eason     85
Amelia    99
Name: Chinese, dtype: int64

In [21]:
score["Chinese"].to_frame()

        Chinese
Janice       95
Vivian       96
May          99
Lisa         90
Eason        85
Amelia       99

In [25]:
score.iloc[1:2]

        Chinese  English  Biology  Com-Sci
Vivian       96       92       88       90

In [26]:
score.loc["Janice"] #.to_frame()

Chinese    95
English    95
Biology    91
Com-Sci    99
Name: Janice, dtype: int64

Using boolean to select data **very important**

In [62]:
score [ score > 90]

        Chinese  English  Biology  Com-Sci
Janice     95.0       95     91.0     99.0
Vivian     96.0       92      NaN      NaN
May        99.0       99    100.0      NaN
Lisa        NaN       92      NaN      NaN
Eason       NaN       93     93.0     99.0
Amelia     99.0       94     91.0      NaN

In [66]:
score ["Chinese"] > 95

Janice    False
Vivian     True
May        True
Lisa      False
Eason     False
Amelia     True
Name: Chinese, dtype: bool

In [28]:
score.loc[score["Com-Sci"] > 95]

        Chinese  English  Biology  Com-Sci
Janice       95       95       91       99
Eason        85       93       93       99

In [30]:
score.loc[score["Com-Sci"] > 95 , "Com-Sci"]

Janice    99
Eason     99
Name: Com-Sci, dtype: int64

In [75]:
score.loc[score["Com-Sci"] > 95 , ["Com-Sci","Chinese"]]

        Com-Sci  Chinese
Janice       99       95
Eason        99       85

dropping

In [77]:
score.drop('Lisa')

        Chinese  English  Biology  Com-Sci
Janice       95       95       91       99
Vivian       96       92       88       90
May          99       99      100       87
Eason        85       93       93       99
Amelia       99       94       91       83

In [80]:
score.drop(columns=["Biology"])

        Chinese  English  Com-Sci
Janice       95       95       99
Vivian       96       92       90
May          99       99       87
Lisa         90       92       86
Eason        85       93       99
Amelia       99       94       83

In [32]:
usuck = pd.Series(
   [-10,-15],
   index =  ["Chinese","Biology"]
)

In [33]:
usuck

Chinese   -10
Biology   -15
dtype: int64

In [34]:
score[["Chinese","Biology"]] + usuck

        Chinese  Biology
Janice       85       76
Vivian       86       73
May          89       85
Lisa         80       66
Eason        75       78
Amelia       89       76

In [35]:
score

        Chinese  English  Biology  Com-Sci
Janice       95       95       91       99
Vivian       96       92       88       90
May          99       99      100       87
Lisa         90       92       81       86
Eason        85       93       93       99
Amelia       99       94       91       83

adding new column

In [41]:
new = pd.Series(
    [90,93,85]
)

In [42]:
new.index = ["May","Lisa","Eason"]

In [45]:
new

May      90
Lisa     93
Eason    85
dtype: int64

In [46]:
score["History"] = new

In [49]:
score

        Chinese  English  Biology  Com-Sci  History
Janice       95       95       91       99      NaN
Vivian       96       92       88       90      NaN
May          99       99      100       87     90.0
Lisa         90       92       81       86     93.0
Eason        85       93       93       99     85.0
Amelia       99       94       91       83      NaN

replace values per places

In [53]:
score["History"] = 90

In [54]:
score

        Chinese  English  Biology  Com-Sci  History
Janice       95       95       91       99       90
Vivian       96       92       88       90       90
May          99       99      100       87       90
Lisa         90       92       81       86       90
Eason        85       93       93       99       90
Amelia       99       94       91       83       90

what if today i want a new column that shows the add up of Chinese + English?

In [66]:
score["Chinese + English"] = score["Chinese"] + score["English"]

In [77]:
score

,Chinese,English,Biology,Com-Sci,History,Chinese + English,jewnoer
Janice,95,95,91,99,90,190,390.0
Vivian,96,92,88,90,90,188,43.0
May,99,99,100,87,90,198,5400000.0
Lisa,90,92,81,86,90,182,342.0
Eason,85,93,93,99,90,178,87.0
Amelia,99,94,91,83,90,193,97.0

In [74]:
score.drop(columns=["jewnoer"])

        Chinese  English  Biology  Com-Sci  History  Chinese + English
Janice       95       95       91       99       90                190
Vivian       96       92       88       90       90                188
May          99       99      100       87       90                198
Lisa         90       92       81       86       90                182
Eason        85       93       93       99       90                178
Amelia       99       94       91       83       90                193

some statistical term to apply

In [76]:
score.sum()

Chinese                  564.0
English                  565.0
Biology                  544.0
Com-Sci                  544.0
History                  540.0
Chinese + English       1129.0
jewnoer              5400959.0
dtype: float64

In [78]:
score.max()

Chinese                   99.0
English                   99.0
Biology                  100.0
Com-Sci                   99.0
History                   90.0
Chinese + English        198.0
jewnoer              5400000.0
dtype: float64

In [79]:
score.min()

Chinese               85.0
English               92.0
Biology               81.0
Com-Sci               83.0
History               90.0
Chinese + English    178.0
jewnoer               43.0
dtype: float64

In [81]:
score.std().round()

Chinese                    6.0
English                    3.0
Biology                    6.0
Com-Sci                    7.0
History                    0.0
Chinese + English          7.0
jewnoer              2204462.0
dtype: float64

In [85]:
score.mean().round()

Chinese                  94.0
English                  94.0
Biology                  91.0
Com-Sci                  91.0
History                  90.0
Chinese + English       188.0
jewnoer              900160.0
dtype: float64

In [87]:
score.describe().round()

,Chinese,English,Biology,Com-Sci,History,Chinese + English,jewnoer
count,6.0,6.0,6.0,6.0,6.0,6.0,6.0
mean,94.0,94.0,91.0,91.0,90.0,188.0,900160.0
std,6.0,3.0,6.0,7.0,0.0,7.0,2204462.0
min,85.0,92.0,81.0,83.0,90.0,178.0,43.0
25%,91.0,92.0,89.0,86.0,90.0,184.0,90.0
50%,96.0,94.0,91.0,88.0,90.0,189.0,220.0
75%,98.0,95.0,92.0,97.0,90.0,192.0,378.0
max,99.0,99.0,100.0,99.0,90.0,198.0,5400000.0

In [88]:
score.quantile()

Chinese               95.5
English               93.5
Biology               91.0
Com-Sci               88.5
History               90.0
Chinese + English    189.0
jewnoer              219.5
Name: 0.5, dtype: float64